# Tap into more sources
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'heroku/brew'
tap 'mongodb/brew'

# TUI
brew 'coreutils'                  # GNU coreutils
brew 'ag'                         # Search in file
brew 'fd'                         # Simple and fast alternative to find
brew 'ripgrep'                    # Another search in file
brew 'gnu-sed'                    # GNU Sed
brew 'telnet'                     # Tool for debugging network connections
brew 'git'                        # Git
brew 'git-flow'                   # Git Flow
brew 'git-lfs'                    # Git LFS
brew 'git-delta'                  # Git Delta (diffs)
brew 'neovim', args: ['HEAD']     # Neovim
brew 'neovim-remote'              # Neovim remote
brew 'stow'                       # Stow for symlinking configs
brew 'lua'                        # Lua
# brew 'lua@5.1'                    # Lua 5.1 # FIXME: This is deprecated
brew 'luajit'                     # LuaJIT
brew 'luarocks'                   # Luarocks
brew 'libgit2'                    # Git library
brew 'gnupg'                      # GPG for signing commits
brew 'gpgme'                      # GPGME for signing commits in Neovim
brew 'pinentry-mac'               # Pinentry for GPG
brew 'stow'                       # Symlink configs
brew 'wget'                       # Download files
brew 'gh'                         # Github CLI
cask 'docker'                     # Docker for Mac
brew 'ranger'                     # File manager
brew 'libpq'                      # Postgres CLI
brew 'p7zip'                      # 7zip
brew 'jq'                         # JSON parser
brew 'earthly'                    # Earthly
brew 'lazygit'                    # CLI git client
brew 'node'                       # NodeJS for Neovim
brew 'tmux'                       # Virtual screens
brew 'tpm'                        # Tmux Plugin Manager
brew 'elixir'                     # Elixir and Erlang
brew 'zsh'                        # ZSH
brew 'bash'                       # Bash (newer than macOS)
brew 'pure'                       # Prompt for ZSH
brew 'ncdu'                       # Disk usage
brew 'prettier'                   # Prettier
brew 'flyctl'                     # Fly.io CLI
brew 'fzf'                        # Fuzzy finder
brew 'bat'                        # Cat with syntax highlighting
brew 'httpie'                     # HTTP client
brew 'btop'                       # Resource monitor
brew 'volta'                      # NodeJS version manager
brew 'deno'                       # Deno
brew 'amfora'                     # Gemini browser
brew 'tree'                       # Tree view for directories
brew 'heroku'                     # Heroku CLI
brew 'rustup'                     # Rust
brew 'awscli'                     # AWS CLI
brew 'mono'                       # Mono
brew 'dotnet'                     # .NET
brew 'make'                       # Make
brew 'cmake'                      # CMake
brew 'openssl'                    # OpenSSL
brew 'zlib'                       # Zlib
brew 'bzip2'                      # Bzip2
brew 'readline'                   # Readline
brew 'sqlite'                     # SQLite
brew 'curl'                       # Curl
brew 'llvm'                       # LLVM
brew 'ncurses'                    # Ncurses
brew 'xz'                         # XZ
brew 'python3'                    # Python 3 (default)
brew 'python@3.9'                 # Python 3.9
brew 'python@3.11'                # Python 3.11
cask 'devpod'                     # DevPod (devcontainers)
brew 'figlet'                     # Figlet
cask 'mactex-no-gui'              # MacTeX without GUI
brew 'xcode-build-server'         # Xcode Build Server
brew 'xcbeautify'                 # Xcode Beautify
brew 'ruby'                       # Ruby
brew 'mongodb-database-tools'     # MongoDB tools

#TODO
#cask 'virtualbox'                 # Virtualbox
#brew 'vagrant'                    # Vagrant
#brew 'terraform'                  # Terraform
#brew 'pnpm'                       # PNPM

# GUI
# System
cask 'onyx'                                 # System cleaning and tweaks
cask 'appcleaner'                           # Allows fully removing old software
mas 'Things', id: 904280696                 # To-do lists
cask 'notion'                               # Notion
mas 'The Unarchiver', id: 425424353         # Handle more compressed file formats
cask 'Raycast'                              # Raycast
cask '1Password'                            # 1Password 8
cask '1password-cli'                        # 1Password integration with CLI
mas '1Password for Safari', id: 1569813296  # 1Password Extension for Safari
cask 'transmission'                         # Torrent client
cask 'docker'                               # Docker Desktop
cask 'rectangle'                            # Arrange windows
cask 'zoom'                                 # Video conferencing
cask 'around'                               # Video conferencing
mas 'AdGuard for Safari', id: 1440147259    # Ad blocker
mas 'xScope 4', id: 889428659	              # UI tools
cask 'vlc'                                  # Media player
cask 'skim'                                 # Skim PDF reader
cask 'inkscape'                             # Inkscape
cask 'airfoil'                              # Airfoil
cask 'keycastr'                   # Keycastr

# Development
cask 'iterm2'                         # Terminal
#cask 'boop'                           # Useful text commands for development
mas 'xScope', id: 889428659           # Tools for graphic development
mas 'Sim Daltonism', id: 693112260    # Simulate color-blindness
cask 'imagealpha'                     # Optimize transparent PNG
cask 'imageoptim'                     # Optimize images
cask 'rapidapi'                       # REST client
cask 'visual-studio-code'             # Text editor
cask 'poedit'                         # l10n
cask 'love'                           # LÖVE
cask 'bfxr'                           # Sound effects
mas 'Xcode', id: 497799835            # Xcode
cask 'studio-3t'                      # MongoDB GUI

# Fonts
cask 'font-hasklig'
cask 'font-hasklug-nerd-font'
cask 'font-symbols-only-nerd-font'

# Browsers
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-beta'
#cask 'firefox-developer-edition'
#cask 'google-chrome-canary'
#cask 'safari-technology-preview'

# Etc
cask 'steam'                                        # Steam
cask 'nvidia-geforce-now'                           # Geforce Now
cask 'discord'                                      # Discord
mas 'Parcel', id: 639968404                         # Shipment tracking
mas 'Awesome Habits: Habit Tracker', id: 1514915737 # Habit tracker
mas 'Telegram', id: 747648890                       # Telegram
mas 'WhatsApp', id: 310633997                       # WhatsApp
brew 'bazarr'                                       # Subtitle downloader

# vscode plugins

# ide features
vscode "spmeesseman.vscode-taskexplorer"    # Task explorer
vscode "Gruntfuggly.todo-tree"              # Tree view of TODOs
vscode "wayou.vscode-todo-highlight"        # Highlight TODOs
vscode "GitHub.copilot"                     # Github Copilot
vscode "GitHub.copilot-chat"                # Github Copilot chat
vscode "GitHub.codespaces"                  # Allow connecting to codespaces
vscode "ms-azuretools.vscode-docker"        # Docker administration
vscode "Catppuccin.catppuccin-vsc"          # Colorscheme/theme

# language features
vscode "ms-python.python"                   # Python
vscode "ms-python.debugpy"                  # Python debugger
vscode "ms-python.vscode-pylance"           # Python LSP
vscode "ms-python.flake8"                   # Python linting
vscode "yinfei.luahelper"                   # Lua LSP
vscode "ms-vscode-remote.remote-containers" # Remote containers
vscode "JakeBecker.elixir-ls"               # Elixir LSP
vscode "ritvyk.heex-html"                   # HEEX syntax highlighting
vscode "bierner.markdown-checkbox"          # Markdown checkboxes

# magic
vscode "asvetliakov.vscode-neovim"          # Neovim integration
vscode "ms-vscode-remote.vscode-remote-extensionpack" # Remote extension pack
vscode "ms-vscode.remote-explorer"          # Remote explorer
vscode "ms-vscode-remote.remote-ssh"        # Remote SSH
vscode "ms-vscode-remote.remote-ssh-edit"   # Remote SSH
vscode "ms-vscode-remote.remote-containers" # Remote containers
