# Tap into more sources
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'heroku/brew'

# TUI
brew 'ag'                         # Search in file
brew 'fd'                         # Simple and fast alternative to find
brew 'ripgrep'                    # Another search in file
brew 'gnu-sed'                    # GNU Sed
brew 'telnet'                     # Tool for debugging network connections
brew 'git'                        # Git
brew 'git-flow'                   # Git Flow
brew 'git-lfs'                    # Git LFS
brew 'git-delta'                  # Git Delta (diffs)
brew 'neovim', args: ['HEAD']     # Neovim
brew 'neovim-remote'              # Neovim remote
brew 'stow'                       # Stow for symlinking configs
brew 'lua'                        # Lua
brew 'luarocks'                   # Luarocks
brew 'gnupg'                      # GPG for signing commits
brew 'stow'                       # Symlink configs
brew 'wget'                       # Download files
brew 'gh'                         # Github CLI
cask 'docker'                     # Docker for Mac
brew 'ranger'                     # File manager
brew 'libpq'                      # Postgres CLI
brew 'p7zip'                      # 7zip
brew 'jq'                         # JSON parser
brew 'earthly'                    # Earthly
brew 'lazygit'                    # CLI git client
brew 'node'                       # NodeJS for Neovim
brew 'tmux'                       # Virtual screens
brew 'tpm'                        # Tmux Plugin Manager
brew 'elixir'                     # Elixir and Erlang
brew 'zsh'                        # ZSH
brew 'pure'                       # Prompt for ZSH
brew 'ncdu'                       # Disk usage
brew 'prettier'                   # Prettier
brew 'flyctl'                     # Fly.io CLI
brew 'fzf'                        # Fuzzy finder
brew 'bat'                        # Cat with syntax highlighting
brew 'httpie'                     # HTTP client
brew 'btop'                       # Resource monitor
brew 'volta'                      # NodeJS version manager
brew 'deno'                       # Deno
brew 'amfora'                     # Gemini browser
brew 'tree'                       # Tree view for directories
brew 'heroku'                     # Heroku CLI
brew 'rustup'                     # Rust
brew 'awscli'                     # AWS CLI
brew 'mono'                       # Mono
brew 'dotnet'                     # .NET

#TODO
#brew 'python3'                    # Python
#cask 'virtualbox'                 # Virtualbox
#brew 'vagrant'                    # Vagrant
#brew 'terraform'                  # Terraform
#brew 'pnpm'                       # PNPM

# GUI
# System
#cask 'onyx'                         # System cleaning and tweaks
cask 'appcleaner'                   # Allows fully removing old software
mas 'Things', id: 904280696         # To-do lists
mas 'The Unarchiver', id: 425424353 # Handle more compressed file formats
mas 'Amphetamine', id: 937984704    # Keep Mac awake
cask '1Password'                    # 1Password 8
cask '1password-cli'                # 1Password integration with CLI
cask 'transmission'                 # Torrent client
cask 'barrier'                      # Synergy fork
cask 'docker'                       # Docker Desktop
cask 'karabiner-elements'           # Keyboard remapping
cask 'rectangle'                    # Arrange windows

# Development
cask 'iterm2'                         # Terminal
cask 'keybase'                        # GPG
cask 'boop'                           # Useful text commands for development
mas 'xScope', id: 889428659           # Tools for graphic development
mas 'Sim Daltonism', id: 693112260    # Simulate color-blindness
cask 'imagealpha'                     # Optimize transparent PNG
cask 'imageoptim'                     # Optimize images
cask 'rapidapi'                       # REST client
cask 'visual-studio-code'             # Text editor
cask 'poedit'                         # l10n
cask 'love'                           # LÖVE
cask 'bfxr'                           # Sound effects
mas 'Xcode', id: 497799835            # Xcode

# Fonts
cask 'font-hasklig'
cask 'font-symbols-only-nerd-font'

# Browsers
cask 'firefox'
cask 'google-chrome'
#cask 'firefox-developer-edition'
#cask 'google-chrome-beta'
#cask 'google-chrome-canary'
#cask 'safari-technology-preview'

# Etc
cask 'steam'
cask 'discord'
mas 'Telegram Lite', id: 946399090

# vscode
vscode "GitHub.codespaces"          # Allow connecting to codespaces
vscode "enkia.tokyo-night"          # Colorscheme/theme
vscode "asvetliakov.vscode-neovim"  # Neovim integration
vscode "yinfei.luahelper"           # Lua LSP
vscode "GitHub.copilot"             # Github Copilot
